app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all # for the json extraction. Don't see why we would list it anywhere else, but we can access it them now.
    # @patients = @doctor.patients
---
SELECT "doctors".* FROM "doctors"

  def create
    @doctor = Doctor.new(doctor_params)
    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("first_name", "last_name", "email", "password_digest", "phone_number") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @doctor.update(doctor_params)
---
UPDATE "doctors" SET "password_digest" = ? WHERE "doctors"."id" = ?  [["password_digest", "$2a$10$taV9AkbUG505ZRmU2UTsxu6mqu5KQMTGocUAHFdvWiY5zMmDOax02"], ["id", 1]]

  def set_doctor
    @doctor = Doctor.find(params[:id])
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT 1  [["id", 1]]